## Plan Result (dcd_cftapps_demo_acme)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.app-proxy-ga-service-connection-secret-management




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.app-proxy-ga-service-connection-secret-management will be created
  + resource "azurerm_role_assignment" "app-proxy-ga-service-connection-secret-management" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dad693c4-36ad-468f-94e9-76faa4bc844b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsdemo"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":27,"Program":"tfcmt","SHA1":"","Target":"dcd_cftapps_demo_acme","Vars":{}} -->